CSI API ETABS v1

# cDCoMexican_RCDF_2004SetOverwrite Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetOverwrite(
    	string Name,
    	int Item,
    	double Value,
    	eItemType ItemType = eItemType.Objects
    )

    Function SetOverwrite (
    	Name As String,
    	Item As Integer,
    	Value As Double,
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cDCoMexican_RCDF_2004
    Dim Name As String
    Dim Item As Integer
    Dim Value As Double
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.SetOverwrite(Name,
    	Item, Value, ItemType)

    int SetOverwrite(
    	String^ Name,
    	int Item,
    	double Value,
    	eItemType ItemType = eItemType::Objects
    )

    abstract SetOverwrite :
            Name : string *
            Item : int *
            Value : float *
            ?ItemType : eItemType
    (* Defaults:
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString

Item

    Type: SystemInt32

Value

    Type: SystemDouble

ItemType (Optional)

    Type: ETABSv1eItemType

#### Return Value

Type: Int32

See Also

#### Reference

cDCoMexican_RCDF_2004 Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com